Transmitter/src/InformationRegisters/ВнешниеФайлы/ВнешниеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВнешниеФайлы</name>
  <resources>
    <name>Data</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Обработчик</name>
    <type>
      <types>CatalogRef.ОбработчикиВнешнихЗапросов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.ИдентификаторКоммита</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Transmitter/src/InformationRegisters/ВнешниеФайлы/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// ЗаписатьДанные сохраняет данные в информационной базе.
// 
// Параметры:
// 	Обработчик - СправочникСсылка.ОбработчикиВнешнихЗапросов - обработчик внешних запросов,
// 																для которого производится запись;
//  Идентификатор - Строка - уникальный идентификатор данных для обработчика;
// 	Данные - Произвольный - произвольные данные;
//
Процедура ЗаписатьДанные( Знач Обработчик, Знач Идентификатор, Знач Данные ) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Обработчик.Установить( Обработчик );
	НаборЗаписей.Отбор.Идентификатор.Установить( Идентификатор );
	
	Запись = НаборЗаписей.Добавить();
	
	Запись.Обработчик = Обработчик;
	Запись.Идентификатор = Идентификатор;
	Запись.Data = Новый ХранилищеЗначения( Данные );
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

// НайтиДанные выполняет поиск данных в информационной базе по заданным параметрам
// с извлечением результата поиска из контейнера ХранилищеЗначения.
// 
// Параметры:
// 	Обработчик - СправочникСсылка.ОбработчикиВнешнихЗапросов - обработчик внешних запросов,
// 																для которого производится поиск записи;
//  Идентификатор - Строка - уникальный идентификатор данных для обработчика;
// 
// Возвращаемое значение:
// 	Произвольный - результат поиска, извлеченный из ХранилищеЗначения;
//  
Функция НайтиДанные( Знач Обработчик, Знач Идентификатор ) Экспорт
	
	Отбор = Новый Структура( "Обработчик, Идентификатор", Обработчик, Идентификатор );
	
	//@skip-check property-return-type
	Данные = Получить( Отбор ).Data; // ХранилищеЗначения
	
	Возврат Данные.Получить();
	
КонецФункции

#КонецОбласти

#КонецЕсли
